#pragma once


//тут должен был быть код класса,но
//когда я сюда перенес ,то всё сломалось
//прям совсем
// "getFrac":не является членом "fraction"
// "printf": передано недостаточно аргументов
// cin:необьявленный идентификатор
// gcd:идентификатор не найден
// "синтаксическая ошибка: ("
//отсутствует спецификатор типа - предполагается int.Примечание.C++ не поддерживает int по умолчанию

// 
// я впервые такое вижу
// я бы попробовал это решить, но закончились сообщения в chatGPT
// простите меня

